
/**
 * JavaScript basic comparison Practice:
 * ------------------------------------- 
 * 
 * 1. তুই আর তোর ছোট ভাইয়ের মধ্যে খাবার কে বেশি খেয়েছে, সেটা তুলনা করবি। তুই 7টা স্যান্ডউইচ খেয়েছিস, আর তোর ছোট ভাই 5টা খেয়েছে। একটা প্রোগ্রাম লিখে
 * দেখ, কে বেশি খেয়েছে।
 * 
 * 2. তোর ক্লাসে 45 জন ছাত্র আছে, আর পাশের ক্লাসে 50 জন। একটা প্রোগ্রাম লিখে দেখ, কোন ক্লাসে বেশি ছাত্র আছে।
 * 
 * 3. তুই আর তোর বন্ধু পরীক্ষায় নম্বর পেয়েছিস। তুই 75 পেয়েছিস, আর তোর বন্ধু পেয়েছে 75। একটা প্রোগ্রাম লিখে চেক কর, তোর আর তোর বন্ধুর নম্বর সমান
 *  কি না।
 * 
 * 4. তুই 100 টাকা জমানোর টার্গেট করেছিস। এখন পর্যন্ত 95 টাকা জমাইছিস। একটা প্রোগ্রাম লিখে চেক কর, তুই টার্গেটে পৌঁছাইছিস কি না বা তার চেয়ে বেশি
 * জমাইছিস কি না।
 * 
 * 5. একটা প্রোগ্রাম লিখে দেখ, 10 এবং 7 কি অসমান (Different)।
 * 
 * 5. 20 কি 15-এর চাইতে কম বা সমান কি না, সেটা চেক কর।
 * 
 * 6. তুই আর তোর বন্ধু একই সাথে পরীক্ষা দিছস। পরীক্ষার দেয়ার পর তোর বন্ধু কেঁদে কেঁদে বুক ভাসিয়ে ফেলছে। তার পরীক্ষা জঘন্য হইছে, সে ফেল করবে। এক মাস
 * পরে রেজাল্টে দেখা গেছে, তুই পাইছস 45 নম্বর আর বন্ধু পাইছে 97 নম্বর। এইবার চেক করে দেখ, তোর বন্ধু কি তোর চাইতে কম নম্বর পাইছে কি না। 
 * 
*/

// Solutions:

// 1 

const ami = 5;
const chotoBhai = 7;

// if(chotoBhai > ami){
//     console.log('বেশি খেয়েছি!');
// }else{
//     console.log('কম খেয়েছি!');
// }


// 2












