
// JavaScript Loop Practice:
//

// 2.  র একদম পছন্দের খাবার লোর নাম লেখ। এখন লুপ ব্যবহার করে  program লিখে দেখ, কীভাবে সব খাবারের নাম আলাদা
// আলাদা করে print হবে ।

// 3. একটা অ্যা রে র মধ্যে  র ফ্যা মি লি মে ম্বা রদে র জসা ল লি খে ফে ল। তা রপর লুপ চা লি য়ে সবা র জসা ল আউটপুট হি সে বে
// দে খা ।
// 4. ক্রি কে ট বা ফুটবল খে লা য়  র প্রি য় একা দশে র একটা ম বা নি য়ে  র প্রি য় খে লো য়া ড়দে র না ম একটা অ্যা রে র মধ্যে রা খ।
// তা রপর কনে ল লগ করে সব খে লো য়া ড়দে র না ম আউটপুট হি সে বে দে খবি ।
// 5. নে ট কবে কবে  র পরী ক্ষা আছে, সে ই তা রি খলা অ্যা রে র মধ্যে লি খে ফে ল। তা রপর লুপ ব্য বহা র করে পরী ক্ষা র
// তা রি খলা কনে ল লগ কর।



//  1. তুই 5টা পছন্দের সাবজেটের নাম লেখ। তারপর program লিখে দেখ, কী ভাবে লুপ ব্যবহার করে সবসাবজে ক্টের নাম
// আলাদা ভাবে প্রিন্ট হবে ।

const favouriteSubjects = ['Science', 'Math', 'Biology', 'Chemistry', 'Physics'];

// for(let i = 0; i < favouriteSubjects.length;i++){
//     console.log(favouriteSubjects[i]);
// }



