
// JavaScript While Loop Practice:



// 2. একটি while লুপ ব্যবহার করে 1 থেকে 20 পর্যন্ত সংখ্যা প্রিন্ট করো।

// 3. একটি while লুপ ব্যবহার করে 50 থেকে 100 পর্যন্ত সংখ্যা প্রিন্ট করো।

// 4. একটি while লুপ দিয়ে 1 থেকে 10 পর্যন্ত সংখ্যা প্রিন্ট করার সময়, সংখ্যাগুলোকে 3 দিয়ে গুণ করো। তাহলে 3-এর নামতা তৈরি হবে।

// 5. একটি while লুপ দিয়ে 111 থেকে 130 পর্যন্ত সংখ্যা প্রিন্ট করার সময়, সংখ্যাগুলোকে 2 দিয়ে ভাগ করো।



// 1. একটি while লুপ দিয়ে 10 বার "console.log" করো:"আমি প্রতিদিন ন্যূনতম ৩ ঘণ্টা করে প্রোগ্রামিং প্র্যাকটিস করবো।

let num = 0;

while(num < 5){
    console.log('Everyday at least 3 hourse for programming');
    num++;
}






