
// JavaScript While loop practice:

// 1. while লুপ ব্যবহার করে ৫০ থেকে ১০০ পর্যন্ত সংখ্যা প্রিন্ট কর।

// 2. while লুপ ব্যবহার করে ৫ থেকে ১৫ পর্যন্ত সংখ্যাগুলোর যোগফল বের কর।

// 3. ধর, একটি স্কুলে ১ থেকে ৫০ পর্যন্ত ছাত্র ভর্তি হয়েছে। while লুপ ব্যবহার করে সব রোল নম্বরের যোগফল বের কর।

// 4. while লুপ ব্যবহার করে ২১ থেকে ৫০ পর্যন্ত সংখ্যাগুলোর যোগফল বের কর এবং তিনবার আউটপুট দেখাও।

// 5. while লুপ ব্যবহার করে ২০ থেকে ৪০ পর্যন্ত সংখ্যাগুলোর যোগফল বের কর এবং শুধুমাত্র ফাইনাল যোগফল আউটপুট হিসেবে দেখাও।



// 1. while লুপ ব্যবহার করে ৫০ থেকে ১০০ পর্যন্ত সংখ্যা প্রিন্ট কর। 
let nums = 50;

while(nums <= 100){
    console.log(nums);
    nums++;
}