
// JavaScript While loop practice:

// 4. while লুপ ব্যবহার করে ২১ থেকে ৫০ পর্যন্ত সংখ্যাগুলোর যোগফল বের কর এবং তিনবার আউটপুট দেখাও।

// 5. while লুপ ব্যবহার করে ২০ থেকে ৪০ পর্যন্ত সংখ্যাগুলোর যোগফল বের কর এবং শুধুমাত্র ফাইনাল যোগফল আউটপুট হিসেবে দেখাও।



// 1. while লুপ ব্যবহার করে ৫০ থেকে ১০০ পর্যন্ত সংখ্যা প্রিন্ট কর। 
let nums = 50;

// while(nums <= 100){
//     console.log(nums);
//     nums++;
// }



// 2. while লুপ ব্যবহার করে ৫ থেকে ১৫ পর্যন্ত সংখ্যাগুলোর যোগফল বের কর।
let sum = 0;
let n1 = 5;

while(n1 <= 15){
    sum += n1;
    n1++;
};
// console.log(sum);


// 3. ধর, একটি স্কুলে ১ থেকে ৫০ পর্যন্ত ছাত্র ভর্তি হয়েছে। while লুপ ব্যবহার করে সব রোল নম্বরের যোগফল বের কর।
let sum2 = 0;
let n2 = 1;

while(n2 <= 50){
    sum2 += n2;
    n2++;
};
// console.log(sum2);

