
// ✅ JavaScript for লুপ প্র্যাকটিস প্রশ্ন:


// 1. for লুপ ব্যবহার করে ১৫০ থেকে ১৭০ পর্যন্ত সংখ্যা প্রিন্ট করো।
// for(let i = 150 ; i <= 170;i++ ){
//     console.log(i);
// }



// 2. ধরো, তুমি একটি স্কুলে ৩১ থেকে ৫৮ পর্যন্ত শিক্ষার্থীদের রোল নম্বর এনট্রি করছো । এরপর একটি for লুপ ব্যবহার করে সেই সংখ্যা গুলোর যোগফল বের করো।
let sum = 0;
for(let i = 31 ; i <= 58;i++ ){
    sum += i;
};
// console.log(sum); // 1246


// 3. for লুপ ব্যবহার করে ২৫ থেকে ৭৫ পর্যন্ত সংখ্যাগুলোর যোগফল বের করো এবং শেষে সেই যোগফল প্রিন্ট করো।


let sum1 = 0;
for(let i = 25 ; i <= 75;i++ ){
    sum1 += i;
};
// console.log(sum1); // 2550