
// ✅ JavaScript Practice :

// Solutions:

// 1. ২০ থেকে ৫০ পর্যন্ত যে সকল সংখ্যা ৭ দিয়ে বিভাজ্য, সেগুলো আউটপুট হিসেবে দেখাও।
for (let i = 20; i <= 50; i++) {

    if(i%7==0){
        // console.log(i);
    }
};


// 2. ৪০ থেকে ৮০ পর্যন্ত যে সকল সংখ্যা ৫ এবং ৭ উভয় দিয়ে বিভাজ্য, সেগুলো আউটপুট হিসেবে দেখাও।


for (let i = 40; i <= 80; i++) {
    if( i%5==0 && i%7==0){
        // console.log(i);
    }
};


// 3. এখন তোমার কাজ হলো ১ থেকে ৪০ পর্যন্ত যে সকল সংখ্যা ১৩ দিয়ে বিভাজ্য, সেগুলোর যোগফল বের করো।

let sum1 = 0;
for (let i = 1; i <= 40; i++) {
    if( i%13==0){
        sum1 += i;
    }
};
// console.log(sum1); // 78


// 4. for লুপ দিয়ে ১ থেকে ৫০ পর্যন্ত লুপ চালাও। তবে লুপ চালানোর সময় লুপ ভ্যারিয়েবলের মান বাড়বে ৪ করে (মানে, প্রতি ধাপে ৪ করে বাড়বে)।

 
for (let i = 1; i <= 50; i = i+4) {
    // console.log(i);
};

// 5. ০ থেকে ১০০ পর্যন্ত এমন সব সংখ্যা প্রিন্ট করো, যেগুলো ৯ এবং ৬ দুই দিয়েই বিভাজ্য।
for (let i = 0; i <= 100; i++) {
    if( i%9==0 && i%6==0){
        // console.log(i);
    }
};

// 6. ১ থেকে ৫০ পর্যন্ত এমন সব সংখ্যা প্রিন্ট করো, যেগুলো ৩ এবং ৪ উভয় দিয়েই বিভাজ্য এবং এই সংখ্যাগুলোর যোগফল বের করো।

let sum5 = 0;

for (let i = 1; i <= 50; i++) {
    if( i%3==0 && i%4==0){
       sum5 += i;
    }
};

// console.log(sum5); // 120 

