
// ✅ JavaScript Practice (সঠিকভাবে লেখা):

// 1. ২০ থেকে ৫০ পর্যন্ত যে সকল সংখ্যা ৭ দিয়ে বিভাজ্য, সেগুলো আউটপুট হিসেবে দেখাও।

// 2. ৪০ থেকে ৮০ পর্যন্ত যে সকল সংখ্যা ৫ এবং ৭ উভয় দিয়ে বিভাজ্য, সেগুলো আউটপুট হিসেবে দেখাও।

// 3. এখন তোমার কাজ হলো ১ থেকে ৪০ পর্যন্ত যে সকল সংখ্যা ১৩ দিয়ে বিভাজ্য, সেগুলোর যোগফল বের করো।

// 4. for লুপ দিয়ে ১ থেকে ৫০ পর্যন্ত লুপ চালাও। তবে লুপ চালানোর সময় লুপ ভ্যারিয়েবলের মান বাড়বে ৪ করে (মানে, প্রতি ধাপে ৪ করে বাড়বে)।

// 5. ০ থেকে ১০০ পর্যন্ত এমন সব সংখ্যা প্রিন্ট করো, যেগুলো ৯ এবং ৬ দুই দিয়েই বিভাজ্য।

// 6. ১ থেকে ৫০ পর্যন্ত এমন সব সংখ্যা প্রিন্ট করো, যেগুলো ৩ এবং ৪ উভয় দিয়েই বিভাজ্য এবং এই সংখ্যাগুলোর যোগফল বের করো।



// Solutions:

// 1. ২০ থেকে ৫০ পর্যন্ত যে সকল সংখ্যা ৭ দিয়ে বিভাজ্য, সেগুলো আউটপুট হিসেবে দেখাও।
for (let i = 20; i <= 50; i++) {

    if(i%7==0){
        // console.log(i);
    }
};



