

// ২. myRoutine নামে একটি ফাংশন লেখো। এই ফাংশনের ভিতরে লিখো তুমি প্রতিদিন সকালে ঘুম থেকে উঠে কী কী কাজ করো। প্রতিটি কাজ একেক লাইনে console.log() দিয়ে দেখাও।

// ৩. তোমার পরিবারের জন্য একটি ফাংশন লেখো। যেকোনো একটা নাম দাও ফাংশনটির। এরপর এই ফাংশনের মধ্যে তোমার পরিবারের সব সদস্যের নাম এক এক করে আউটপুটে দেখাও।

// ৪. taskDone নামে একটি ফাংশন লেখো। এই ফাংশনে তোমার সারাদিনের ৫টি কাজ একেক লাইনে console.log() দিয়ে দেখাও।

// ৫. greetMe নামে একটি ফাংশন লেখো। ফাংশনটি কল করলে আউটপুটে দেখাবে— “Good Morning! Have a great day!”

// ৬. তোমার সবচেয়ে ক্লোজ তিন বন্ধুর নাম দেখানোর জন্য getFavFriends নামে একটি ফাংশন লেখো। এরপর ফাংশনের মধ্যে তোমার তিনজন প্রিয় বন্ধুর নাম আউটপুটে দেখাও।

// ৭. introduceMyself নামে একটি ফাংশন লেখো। ফাংশনটি কল করলে তোমার নাম, বয়স, ঠিকানা, ফোন নম্বর, পেশা ও প্রিয় খাবার আউটপুটে দেখাও।



// Solutions:

// ১. juiceKhao নামে একটি ফাংশন লেখো। এই ফাংশনটি কল করলে আউটপুটে দেখাবে— “এই নাও লেবুর জুস।”

function juiceKhao(){
  console.log('Ai new lebor joos!');
}

juiceKhao();

