


// 2. রেক এক বন্ধু বলল ক্যালকুলেটর বানাতে, কিন্তু ক্যালকুলেটরে শুধু গুণ বা ভাগ করার অপশন থাকলে হবে না। একটা ফাংশন লেখো, যেখানে দুইটা সংখ্যার গুণফল দেখাবে। যেমন, যদি ২০ আর ১৫ পাঠাও, আউটপুট হবে ৩০০।

// 3. একটা ফাংশন লেখো, যেটা তিনটা সাবজেক্টের পরীক্ষার মার্কসের যোগফল দেখাবে।

// 4. বয়স বের করার একটা ফাংশন লেখো। যেটাকে তুমি জন্মের বছর বলবে, তারপর ফাংশনের ভিতরে এই বছর থেকে সেই বছর বাদ দিলে বলে দেবে তুমি কত বছর বয়সের হয়েছো।

// 5. তুমি একটা দোকানে গেছো, যেখানে একটি লাউ কেনার জন্য ৩৫ টাকা লাগে। এখন একটা ফাংশন লেখো, যা প্যারামিটার হিসেবে নেবে তুমি লাউয়ের জন্য কত টাকা দিতে চাও। তারপর ভাগ করে বলে দেবে তুমি কয়টা লাউ কিনতে পারবে।

// 6. একটা ফাংশন লেখো, যেখানে চারটা সংখ্যার গড় বের করবে।

// 7. একজন দোকানদার প্রতি আইটেমে ২৫০ টাকা লাভ করে। একটা ফাংশন লেখো, যেখানে কোনো একটা জিনিসের কেনার দাম দিলে, সে বিক্রির দাম (selling price) দিয়ে দেবে।

// 8. একটা ফাংশন লেখো, তারপর সেই ফাংশনে জন্ম সাল প্যারামিটার হিসেবে দেবে। তারপর সে বলে দেবে, কোন বছরে তোমার বয়স ১০০ বছর হবে।

// 9. একটা ফাংশন লেখো, যেখানে প্যারামিটার হিসেবে দেবে, প্রতিদিন তুমি কয় ঘণ্টা সময় মোবাইল ইউজ করো। তারপর সেই ফাংশন বের করবে, মাসে তুমি মোট কত ঘণ্টা মোবাইল ইউজ করো (ধরে নাও, এক মাসে ৩০ দিন)।


function fatherAndChildrenAgeMultipication(children , father){
  const result = children * father;
  console.log(result);
}

fatherAndChildrenAgeMultipication(21,48);