

// 2. এমন একটি ফাংশন লিখুন, যা কোনও সংখ্যা ইনপুট হিসেবে গ্রহণ করবে এবং চেক করবে তা 13 দিয়ে নিঃশেষভাবে বিভাজ্য কিনা। বিভাজ্য হলে true আর না হলে false রিটার্ন করবে।

// 3. তুমি একটি রেস্টুরেন্টে গিয়েছ এবং খাবে — ভাত (rice), তরকারি (curry) আর ড্রিংস (drinks)। এমন একটি ফাংশন লিখতে হবে, যা এই তিনটি খাবারের দাম ইনপুট হিসেবে গ্রহণ করে তাদের মোট দাম (টোটাল বিল) রিটার্ন করবে।

// 4. এমন একটি ফাংশন লিখুন, যা ইনপুট হিসেবে বয়স গ্রহণ করবে এবং চেক করবে ব্যক্তির বয়স 18 এর বেশি কিনা। যদি বেশি হয়, Eligible for Voting আর না হলে Not Eligible রিটার্ন করবে।

// 5. এমন একটি ফাংশন লিখুন, যা ইনপুট হিসেবে কোনও স্ট্রিং গ্রহণ করবে এবং সেই স্ট্রিং এর দৈর্ঘ্য রিটার্ন করবে।

// 6. এমন একটি ফাংশন লিখুন, যা তিনটি সংখ্যা ইনপুট হিসেবে গ্রহণ করবে এবং তাদের গড় রিটার্ন করবে।

// 7. এমন একটি ফাংশন লিখুন, যা ইনপুট হিসেবে কোনও সংখ্যা গ্রহণ করবে এবং চেক করবে তা নেগেটিভ কিনা। যদি নেগেটিভ হয়, তা -1 দিয়ে গুণ করে রিটার্ন করবে, আর না হলে আগের মতোই রিটার্ন করবে।


// Solutions:

// 1. এমন একটি ফাংশন লিখুন, যা কোনও সংখ্যাকে ইনপুট হিসেবে গ্রহণ করবে এবং চেক করবে তা 10 এর চেয়ে বড় কিনা। যদি হয়, true রিটার্ন করবে, আর না হলে false রিটার্ন করবে।

function myFunc(num){

  if(num > 10){
    return true;
  }
  else{
    return false;
  }
};

console.log(myFunc(11));
