
/**
 * JavaScript Comments Problem Solving
 * 
 * 
 * 1. তুই score নামে একটা ভেরিয়েবল লিখ। এখন এইটা কীসের স্কোর, সেটা ভেরিয়েবলের নাম দেখে বুঝা যাচ্ছে না। তাই এই ভেরিয়েবল ডিক্লেয়ার করার ওপরে এক লাইন কমেন্ট লিখ। কমেন্টে থাকবে, এইটা কীসের স্কোর।
 * 
 * 2. এখন radius নামে একটা ভেরিয়েবল লিখ। তারপর এইটা কীসের রেডিয়াস, সেটা বুঝানোর জন্য তিন লাইনের কমেন্ট লিখ। প্রত্যেক লাইনের আগে স্ল্যাশ চিহ্ন দিয়ে কমেন্ট লিখবি। 
 * 
 * 3. তোর পছন্দের জামা কয়টা, সেটা নিয়ে dress নামে একটা ভেরিয়েবল ডিক্লেয়ার কর। তারপর সেটার ওপর মাল্টিলাইন কমেন্ট লিখ স্ল্যাশ এবং এস্টেরিস্ক চিহ্ন দিয়ে।
 * 
 * 4. তোকে একটা গিফট হিসেবে 100 টাকা দেওয়া হয়েছে, giftMoney নামে একটা ভেরিয়েবলে রাখ। তারপর কমেন্টে লিখবি, এই টাকা কী কারণে দেওয়া হয়েছে।
 * 
 * 5. তুই ঠিক করলি 7 ঘণ্টা পড়ালেখা করবি। studyTime নামে একটি ভেরিয়েবলে রাখ। তার ওপর চার-পাঁচ লাইনের কমেন্ট লিখ, এই 7 ঘণ্টার মধ্যে কোন কোন সাবজেক্টের কী কী জিনিস তুই কতক্ষণ ধরে পড়বি। 
 * 
 * 6. তোর মোবাইল পেমেন্টের জন্য sendMoney নামে একটি ভেরিয়েবল ডিক্লেয়ার কর। তার ওপর দুই লাইনের কমেন্ট লিখ, যাকে মানি সেন্ড করতেছস, সে কত টাকা পাবে, আর সার্ভিস ফি কত টাকা। 
 * 
 * 7. তুই অনলাইন থেকে একটা প্রোডাক্ট অর্ডার করছস। তোর কাছ থেকে মোট কত টাকা নিবে, সেটা pay নামে একটা ভেরিয়েবলে রাখ। তারপর ওপরে এক লাইন কমেন্ট লিখবি। এই টাকার মধ্যে প্রোডাক্টের দাম এবং ডেলিভারি ফি যোগ করা আছে।  
 * 
 */ 


// Solutions:

// 1

const score = 60 // assignment marks score from 60 to 60


// 2

const radius = 10;

// এটা একটি বৃত্তের রেডিয়াস।
// বৃত্তটি একটি লজিক্যাল গাণিতিক সমস্যা থেকে নেওয়া হয়েছে।
// এই রেডিয়াস ব্যবহার করে আমরা ক্ষেত্রফল বা পরিধি বের করতে পারি।

// 3

const dress = 3;
/**
 * 1. Gence pent
 * 2. LightGray penr
 * 3. Black Pent
 * 
*/

// 4
const giftMoney = 100; // this is gifted money

// 5

const studyTime = 7;

/**
 * Tuition : 3h
 * Next Level Developer : 3h
 * Problem Solving : 1h
 * 
 */

// 6 

const sendMoney = 1020;

// Kalam get        - 1000
// Sent money cost  - 20







