
/**
 * 
 * Variable : Practice Problem
 * 
 * 1. তোর জন্মসালটি একটা ভেরিয়েবলে রাখ।
 * 2. তোরা কয় ভাই-বোন, সেটা একটা ভেরিয়েবলে রাখ।
 * 3. তোর ক্লাসে কতজন স্টুডেন্ট আছে, তাদের সংখ্যা দিয়ে students নামক একটা ভেরিয়েবল ডিক্লেয়ার কর।
 * 4. লাস্ট পরীক্ষায় কত নাম্বার পাইছিলি, সেটা দিয়ে marks নামক একটা ভেরিয়েবল ডিক্লেয়ার কর। 
 * 5. তোর বাসায় কয়টা রুম আছে, সেটা নিয়ে rooms নামক একটা ভেরিয়েবল ডিক্লেয়ার কর।
 * 6. তোর দৈনিক পড়াশোনার সময়কে ঘণ্টা হিসেবে একটি ভেরিয়েবলে রাখ।
 * 7. তোর ফোন নাম্বারে যতগুলা ডিজিট বা অঙ্ক যোগ করে যোগফল total নামে একটা ভেরিয়েবলে রাখ।
 * 
 * 
*/

// 1
const dateOfBirth = '04/12/2005';

// 2
const silblings = 4;

// 3. 
const students = 1010;

// 4
const marks = 60;

// 5
const rooms = 3;

// 6 
const studyHour = 6;

// 7
const total = 66;
